app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("created_at", "updated_at", "title", "room_number") VALUES (?, ?, ?, ?)  [["created_at", "2019-09-23 21:56:59.588691"], ["updated_at", "2019-09-23 21:56:59.588691"], ["title", "Computer Science"], ["room_number", 5]]
---
    def create
        @school_class = SchoolClass.new(school_class_params)
        @school_class.save

UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", nil], ["room_number", nil], ["updated_at", "2019-09-23 15:22:58.556717"], ["id", 6]]
---
    def update
        find_class
        @school_class.update(school_class_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def find_class
        @school_class = SchoolClass.find(params[:id])